# Data Pre-processing | Data Cleaning

ðŸ¤– `Notebook by` [Ihsanul Haque](https://www.linkedin.com/in/ihsanul09/)

âœ… `Machine Learning Source Codes` [GitHub](https://https://github.com/ihsanulcode/ML-Batch-2)

ðŸ“Œ `Machine Learning from Scratch` [Course Outline](https://https://docs.google.com/document/d/15mGNTUSlWQsy4TzcLZUdYedpCMO5KiVq1USaDprHaIc/edit?usp=sharing)

## Handle Duplicates

In [1]:
import pandas as pd

# Sample DataFrame with duplicate rows
data = {
    'ID': [1, 2, 3, 1, 4, 2, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Bob', 'Eve'],
    'Age': [25, 30, 35, 25, 40, 30, 28]
}

df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      7 non-null      int64
 1   Name    7 non-null      object
 2   Age     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [3]:
df.head(10)

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   1    Alice   25
4   4    David   40
5   2      Bob   30
6   5      Eve   28

In [4]:
# Delete duplicate rows
duplicate_rows = df[df.duplicated()]
duplicate_rows

   ID   Name  Age
3   1  Alice   25
5   2    Bob   30

In [5]:
count_duplicates = df.duplicated().sum()
count_duplicates

2

In [6]:
df.drop_duplicates(inplace=True)

In [7]:
df.head(10)

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
4   4    David   40
6   5      Eve   28

## Drop unnecessary Column

In [9]:
import pandas as pd

# Create a sample dataset with an 'id' column
data = {'id': [1, 2, 3],
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Salary': [50000, 60000, 70000]}

df = pd.DataFrame(data)
df.info()

# drop the 'id' column
df.drop(columns=['id'], inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   Name    3 non-null      object
 2   Salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Salary  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

## Handle Missing Values

In [11]:
import pandas as pd

# Create a sample dataset with missing values
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 30, None, 22, 28],
        'Salary': [50000, None, 60000, 45000, 55000],
        'City': ['New York', 'San Francisco', 'Los Angeles', None, 'Chicago']}

df = pd.DataFrame(data)
print("Original Dataset:")
df.info()

Original Dataset:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Salary  4 non-null      float64
 3   City    4 non-null      object
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [12]:
# 1. Drop rows with missing values
df_cleaned = df.dropna()
df_cleaned

    Name   Age   Salary      City
0  Alice  25.0  50000.0  New York
4    Eva  28.0  55000.0   Chicago

In [13]:
# 2. Replace missing values
df_filled = df.copy()
df_filled['Age'].fillna(df_filled['Age'].mean(), inplace=True)
df_filled['Salary'].fillna(df_filled['Salary'].median(), inplace=True)
df_filled

      Name    Age   Salary           City
0    Alice  25.00  50000.0       New York
1      Bob  30.00  52500.0  San Francisco
2  Charlie  26.25  60000.0    Los Angeles
3    David  22.00  45000.0           None
4      Eva  28.00  55000.0        Chicago

## Data Type Conversions
Depending on data context

In [14]:
import pandas as pd

# Create a sample dataset with a column in object type that should be in float
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': ['25', '30', 'None', '22', '28'],  # Age is represented as strings
        'Salary': [50000, 60000, 70000, 45000, 55000]}

df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      object
 2   Salary  5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [16]:
# Convert the 'Age' column dtype
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     4 non-null      float64
 2   Salary  5 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [18]:
# Numeric to string conversion

# Sample dataset
data = {'numeric_column': [1,2,3,4,5]}
df = pd.DataFrame(data)
df.info()

# Conversion
df['numeric_column'] = df['numeric_column'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   numeric_column  5 non-null      int64
dtypes: int64(1)
memory usage: 172.0 bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   numeric_column  5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

## Check for Inconsistencies in Naming Conventions

In [20]:
import pandas as pd

# Create a sample dataset with a 'Name' column containing inconsistencies
data = {'Name': ['Alice', 'bob', 'Charlie', 'david', 'Eva']}
df = pd.DataFrame(data)

# Display the original dataset
print("Original Dataset:")
print(df)

# check for Inconsistencies in naming conversions and format
df['Name'] = df['Name'].apply(lambda x: x.title())
df

Original Dataset:
      Name
0    Alice
1      bob
2  Charlie
3    david
4      Eva

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

## Check for Feature Naming Formats

In [22]:
import pandas as pd

# Create a sample dataset with columns containing white spaces
data = {'First Name': ['Alice', 'Bob', 'Charlie'],
        'Last Name': ['Smith', 'Jones', 'Brown'],
        'Age Group': ['Young', 'Middle', 'Young']}

df = pd.DataFrame(data)

# Display the original dataset
print("Original Dataset:")
print(df)

# Edit column names
df.columns = df.columns.str.replace(' ','_').str.lower()
df.info()

Original Dataset:
  First Name Last Name Age Group
0      Alice     Smith     Young
1        Bob     Jones    Middle
2    Charlie     Brown     Young
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  3 non-null      object
 1   last_name   3 non-null      object
 2   age_group   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

# Thank you
Â© [Dataque Academy](https://www.facebook.com/dataque.academy)